---
type: FootPrintRoof
namespace: Autodesk.Revit.DB
version: 2024
members: 8
tags: [revit-api, class]
---

# FootPrintRoof

`Autodesk.Revit.DB.FootPrintRoof` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetProfiles | — | `public ModelCurveArrArray GetProfiles ()` |
| Property | CurtainGrids | — | `public CurtainGridSet CurtainGrids { get ; }` |
| Property | DefinesSlope | — | `public bool this [ ModelCurve pCurve ] { get ; set ; }` |
| Property | ExtendIntoWall | — | `public bool this [ ModelCurve pCurve ] { get ; set ; }` |
| Property | Offset | — | `public double this [ ModelCurve pCurve ] { get ; set ; }` |
| Property | Overhang | — | `public double this [ ModelCurve pCurve ] { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | SlopeAngle | — | `public double this [ ModelCurve pCurve ] { get ; set ; }` |